soap.xml

`<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:air="http://www.travelport.com/schema/air_v52_0" xmlns:com="http://www.travelport.com/schema/common_v52_0">
    <soapenv:Body>
      <air:LowFareSearchReq TargetBranch="P7144368" TraceId="8gH4CX0uHk564RbV96E2Dw" SolutionResult="false" AuthorizedBy="UAPIAVIA">
        <com:BillingPointOfSaleInfo OriginApplication="uAPI" />
        <air:SearchAirLeg>
          <air:SearchOrigin>
            <com:CityOrAirport Code="ICN" PreferCity="true" />
          </air:SearchOrigin>
          <air:SearchDestination>
            <com:CityOrAirport Code="NRT" PreferCity="true" />
          </air:SearchDestination>
          <air:SearchDepTime PreferredTime="2025-09-23" />
          <air:AirLegModifiers MaxConnectionTime="000"></air:AirLegModifiers>
        </air:SearchAirLeg>
        <air:AirSearchModifiers>
          <air:PreferredProviders>
            <com:Provider Code="1G" />
          </air:PreferredProviders>
          <air:FlightType NonStopDirects="true" StopDirects="true" SingleOnlineCon="false" SingleInterlineCon="false" />
        </air:AirSearchModifiers>
        <com:SearchPassenger Code="ADT" />
      </air:LowFareSearchReq>
    </soapenv:Body>
  </soapenv:Envelope>`